## Production: alarms
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 18 to add, 19 to change, 7 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                              NAME                                               |
|--------|-------------------------------------------------------------------------------------------------|
| delete | `aws_cloudwatch_log_subscription_filter.archiver_log_stream`                                    |
|        | `aws_cloudwatch_log_subscription_filter.audit_log_stream`                                       |
|        | `aws_cloudwatch_log_subscription_filter.dlq_consumer_log_stream`                                |
|        | `aws_cloudwatch_log_subscription_filter.nagware_log_stream`                                     |
|        | `aws_cloudwatch_log_subscription_filter.reliability_log_stream`                                 |
|        | `aws_cloudwatch_log_subscription_filter.submission_log_stream`                                  |
|        | `aws_cloudwatch_log_subscription_filter.template_archiver_log_stream`                           |
| update | `aws_cloudwatch_event_rule.codedeploy_sns`                                                      |
|        | `aws_cloudwatch_log_group.notify_slack`                                                         |
|        | `aws_cloudwatch_metric_alarm.ELB_5xx_error_warn`                                                |
|        | `aws_cloudwatch_metric_alarm.alb_ddos`                                                          |
|        | `aws_cloudwatch_metric_alarm.audit_log_dead_letter_queue_warn`                                  |
|        | `aws_cloudwatch_metric_alarm.cognito_signin_exceeded`                                           |
|        | `aws_cloudwatch_metric_alarm.ddos_detected_forms_warn`                                          |
|        | `aws_cloudwatch_metric_alarm.ddos_detected_route53_warn[0]`                                     |
|        | `aws_cloudwatch_metric_alarm.ddos_detected_route53_warn[1]`                                     |
|        | `aws_cloudwatch_metric_alarm.forms_cpu_utilization_high_warn`                                   |
|        | `aws_cloudwatch_metric_alarm.forms_memory_utilization_high_warn`                                |
|        | `aws_cloudwatch_metric_alarm.reliability_dead_letter_queue_warn`                                |
|        | `aws_cloudwatch_metric_alarm.response_time_warn`                                                |
|        | `aws_cloudwatch_metric_alarm.route53_ddos[0]`                                                   |
|        | `aws_cloudwatch_metric_alarm.route53_ddos[1]`                                                   |
|        | `aws_cloudwatch_metric_alarm.twoFa_verification_exceeded`                                       |
|        | `aws_iam_role.notify_slack_lambda`                                                              |
|        | `aws_lambda_function.notify_slack`                                                              |
|        | `module.athena_bucket.aws_s3_bucket.this`                                                       |
| add    | `aws_cloudwatch_log_subscription_filter.lambda_error_detection[&quot;audit_log&quot;]`                    |
|        | `aws_cloudwatch_log_subscription_filter.lambda_error_detection[&quot;dlq_consumer&quot;]`                 |
|        | `aws_cloudwatch_log_subscription_filter.lambda_error_detection[&quot;nagware&quot;]`                      |
|        | `aws_cloudwatch_log_subscription_filter.lambda_error_detection[&quot;reliability&quot;]`                  |
|        | `aws_cloudwatch_log_subscription_filter.lambda_error_detection[&quot;response_archiver&quot;]`            |
|        | `aws_cloudwatch_log_subscription_filter.lambda_error_detection[&quot;submission&quot;]`                   |
|        | `aws_cloudwatch_log_subscription_filter.lambda_error_detection[&quot;template_archiver&quot;]`            |
|        | `aws_cloudwatch_log_subscription_filter.lambda_error_detection[&quot;vault_data_integrity_check&quot;]`   |
|        | `aws_cloudwatch_log_subscription_filter.lambda_timeout_detection[&quot;audit_log&quot;]`                  |
|        | `aws_cloudwatch_log_subscription_filter.lambda_timeout_detection[&quot;dlq_consumer&quot;]`               |
|        | `aws_cloudwatch_log_subscription_filter.lambda_timeout_detection[&quot;nagware&quot;]`                    |
|        | `aws_cloudwatch_log_subscription_filter.lambda_timeout_detection[&quot;reliability&quot;]`                |
|        | `aws_cloudwatch_log_subscription_filter.lambda_timeout_detection[&quot;response_archiver&quot;]`          |
|        | `aws_cloudwatch_log_subscription_filter.lambda_timeout_detection[&quot;submission&quot;]`                 |
|        | `aws_cloudwatch_log_subscription_filter.lambda_timeout_detection[&quot;template_archiver&quot;]`          |
|        | `aws_cloudwatch_log_subscription_filter.lambda_timeout_detection[&quot;vault_data_integrity_check&quot;]` |
|        | `aws_cloudwatch_metric_alarm.cognito_login_outside_canada_warn`                                 |
|        | `aws_cloudwatch_metric_alarm.vault_data_integrity_check_lambda_iterator_age`                    |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.codedeploy_sns will be updated in-place
  ~ resource "aws_cloudwatch_event_rule" "codedeploy_sns" {
        id             = "alert-on-codedeploy-status"
        name           = "alert-on-codedeploy-status"
      ~ tags           = {
          - "CostCentre" = "forms-platform-production" -> null
          - "Terraform"  = "true" -> null
        }
        # (7 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_group.notify_slack will be updated in-place
  ~ resource "aws_cloudwatch_log_group" "notify_slack" {
        id                = "/aws/lambda/NotifySlack"
        name              = "/aws/lambda/NotifySlack"
      ~ retention_in_days = 90 -> 731
        tags              = {}
      ~ tags_all          = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
        # (4 unchanged attributes hidden)
    }

  # aws_cloudwatch_log_subscription_filter.archiver_log_stream will be destroyed
  # (because aws_cloudwatch_log_subscription_filter.archiver_log_stream is not in configuration)
  - resource "aws_cloudwatch_log_subscription_filter" "archiver_log_stream" {
      - destination_arn = "arn:aws:lambda:ca-central-1:957818836222:function:NotifySlack" -> null
      - distribution    = "ByLogStream" -> null
      - filter_pattern  = "{($.level = \"warn\") || ($.level = \"error\")}" -> null
      - id              = "cwlsf-2821336831" -> null
      - log_group_name  = "/aws/lambda/Archiver" -> null
      - name            = "archiver_log_stream" -> null
    }

  # aws_cloudwatch_log_subscription_filter.audit_log_stream will be destroyed
  # (because aws_cloudwatch_log_subscription_filter.audit_log_stream is not in configuration)
  - resource "aws_cloudwatch_log_subscription_filter" "audit_log_stream" {
      - destination_arn = "arn:aws:lambda:ca-central-1:957818836222:function:NotifySlack" -> null
      - distribution    = "ByLogStream" -> null
      - filter_pattern  = "{($.level = \"warn\") || ($.level = \"error\")}" -> null
      - id              = "cwlsf-1997887864" -> null
      - log_group_name  = "/aws/lambda/AuditLogs" -> null
      - name            = "audit_log_stream" -> null
    }

  # aws_cloudwatch_log_subscription_filter.dlq_consumer_log_stream will be destroyed
  # (because aws_cloudwatch_log_subscription_filter.dlq_consumer_log_stream is not in configuration)
  - resource "aws_cloudwatch_log_subscription_filter" "dlq_consumer_log_stream" {
      - destination_arn = "arn:aws:lambda:ca-central-1:957818836222:function:NotifySlack" -> null
      - distribution    = "ByLogStream" -> null
      - filter_pattern  = "{($.level = \"warn\") || ($.level = \"error\")}" -> null
      - id              = "cwlsf-3956109137" -> null
      - log_group_name  = "/aws/lambda/DeadLetterQueueConsumer" -> null
      - name            = "dql_consumer_log_stream" -> null
    }

  # aws_cloudwatch_log_subscription_filter.lambda_error_detection["audit_log"] will be created
  + resource "aws_cloudwatch_log_subscription_filter" "lambda_error_detection" {
      + destination_arn = "arn:aws:lambda:ca-central-1:957818836222:function:NotifySlack"
      + distribution    = "ByLogStream"
      + filter_pattern  = "{($.level = \"warn\") || ($.level = \"error\")}"
      + id              = (known after apply)
      + log_group_name  = "/aws/lambda/AuditLogs"
      + name            = "error_detection_in_audit_log_lambda_logs"
      + role_arn        = (known after apply)
    }

  # aws_cloudwatch_log_subscription_filter.lambda_error_detection["dlq_consumer"] will be created
  + resource "aws_cloudwatch_log_subscription_filter" "lambda_error_detection" {
      + destination_arn = "arn:aws:lambda:ca-central-1:957818836222:function:NotifySlack"
      + distribution    = "ByLogStream"
      + filter_pattern  = "{($.level = \"warn\") || ($.level = \"error\")}"
      + id              = (known after apply)
      + log_group_name  = "/aws/lambda/DeadLetterQueueConsumer"
      + name            = "error_detection_in_dlq_consumer_lambda_logs"
      + role_arn        = (known after apply)
    }

  # aws_cloudwatch_log_subscription_filter.lambda_error_detection["nagware"] will be created
  + resource "aws_cloudwatch_log_subscription_filter" "lambda_error_detection" {
      + destination_arn = "arn:aws:lambda:ca-central-1:957818836222:function:NotifySlack"
      + distribution    = "ByLogStream"
      + filter_pattern  = "{($.level = \"warn\") || ($.level = \"error\")}"
      + id              = (known after apply)
      + log_group_name  = "/aws/lambda/Nagware"
      + name            = "error_detection_in_nagware_lambda_logs"
      + role_arn        = (known after apply)
    }

  # aws_cloudwatch_log_subscription_filter.lambda_error_detection["reliability"] will be created
  + resource "aws_cloudwatch_log_subscription_filter" "lambda_error_detection" {
      + destination_arn = "arn:aws:lambda:ca-central-1:957818836222:function:NotifySlack"
      + distribution    = "ByLogStream"
      + filter_pattern  = "{($.level = \"warn\") || ($.level = \"error\")}"
      + id              = (known after apply)
      + log_group_name  = "/aws/lambda/Reliability"
      + name            = "error_detection_in_reliability_lambda_logs"
      + role_arn        = (known after apply)
    }

  # aws_cloudwatch_log_subscription_filter.lambda_error_detection["response_archiver"] will be created
  + resource "aws_cloudwatch_log_subscription_filter" "lambda_error_detection" {
      + destination_arn = "arn:aws:lambda:ca-central-1:957818836222:function:NotifySlack"
      + distribution    = "ByLogStream"
      + filter_pattern  = "{($.level = \"warn\") || ($.level = \"error\")}"
      + id              = (known after apply)
      + log_group_name  = "/aws/lambda/Response_Archiver"
      + name            = "error_detection_in_response_archiver_lambda_logs"
      + role_arn        = (known after apply)
    }

  # aws_cloudwatch_log_subscription_filter.lambda_error_detection["submission"] will be created
  + resource "aws_cloudwatch_log_subscription_filter" "lambda_error_detection" {
      + destination_arn = "arn:aws:lambda:ca-central-1:957818836222:function:NotifySlack"
      + distribution    = "ByLogStream"
      + filter_pattern  = "{($.level = \"warn\") || ($.level = \"error\")}"
      + id              = (known after apply)
      + log_group_name  = "/aws/lambda/Submission"
      + name            = "error_detection_in_submission_lambda_logs"
      + role_arn        = (known after apply)
    }

  # aws_cloudwatch_log_subscription_filter.lambda_error_detection["template_archiver"] will be created
  + resource "aws_cloudwatch_log_subscription_filter" "lambda_error_detection" {
      + destination_arn = "arn:aws:lambda:ca-central-1:957818836222:function:NotifySlack"
      + distribution    = "ByLogStream"
      + filter_pattern  = "{($.level = \"warn\") || ($.level = \"error\")}"
      + id              = (known after apply)
      + log_group_name  = "/aws/lambda/Archive_Form_Templates"
      + name            = "error_detection_in_template_archiver_lambda_logs"
      + role_arn        = (known after apply)
    }

  # aws_cloudwatch_log_subscription_filter.lambda_error_detection["vault_data_integrity_check"] will be created
  + resource "aws_cloudwatch_log_subscription_filter" "lambda_error_detection" {
      + destination_arn = "arn:aws:lambda:ca-central-1:957818836222:function:NotifySlack"
      + distribution    = "ByLogStream"
      + filter_pattern  = "{($.level = \"warn\") || ($.level = \"error\")}"
      + id              = (known after apply)
      + log_group_name  = "/aws/lambda/Vault_Data_Integrity_Check"
      + name            = "error_detection_in_vault_data_integrity_check_lambda_logs"
      + role_arn        = (known after apply)
    }

  # aws_cloudwatch_log_subscription_filter.lambda_timeout_detection["audit_log"] will be created
  + resource "aws_cloudwatch_log_subscription_filter" "lambda_timeout_detection" {
      + destination_arn = "arn:aws:lambda:ca-central-1:957818836222:function:NotifySlack"
      + distribution    = "ByLogStream"
      + filter_pattern  = "Task timed out"
      + id              = (known after apply)
      + log_group_name  = "/aws/lambda/AuditLogs"
      + name            = "timeout_detection_in_audit_log_lambda_logs"
      + role_arn        = (known after apply)
    }

  # aws_cloudwatch_log_subscription_filter.lambda_timeout_detection["dlq_consumer"] will be created
  + resource "aws_cloudwatch_log_subscription_filter" "lambda_timeout_detection" {
      + destination_arn = "arn:aws:lambda:ca-central-1:957818836222:function:NotifySlack"
      + distribution    = "ByLogStream"
      + filter_pattern  = "Task timed out"
      + id              = (known after apply)
      + log_group_name  = "/aws/lambda/DeadLetterQueueConsumer"
      + name            = "timeout_detection_in_dlq_consumer_lambda_logs"
      + role_arn        = (known after apply)
    }

  # aws_cloudwatch_log_subscription_filter.lambda_timeout_detection["nagware"] will be created
  + resource "aws_cloudwatch_log_subscription_filter" "lambda_timeout_detection" {
      + destination_arn = "arn:aws:lambda:ca-central-1:957818836222:function:NotifySlack"
      + distribution    = "ByLogStream"
      + filter_pattern  = "Task timed out"
      + id              = (known after apply)
      + log_group_name  = "/aws/lambda/Nagware"
      + name            = "timeout_detection_in_nagware_lambda_logs"
      + role_arn        = (known after apply)
    }

  # aws_cloudwatch_log_subscription_filter.lambda_timeout_detection["reliability"] will be created
  + resource "aws_cloudwatch_log_subscription_filter" "lambda_timeout_detection" {
      + destination_arn = "arn:aws:lambda:ca-central-1:957818836222:function:NotifySlack"
      + distribution    = "ByLogStream"
      + filter_pattern  = "Task timed out"
      + id              = (known after apply)
      + log_group_name  = "/aws/lambda/Reliability"
      + name            = "timeout_detection_in_reliability_lambda_logs"
      + role_arn        = (known after apply)
    }

  # aws_cloudwatch_log_subscription_filter.lambda_timeout_detection["response_archiver"] will be created
  + resource "aws_cloudwatch_log_subscription_filter" "lambda_timeout_detection" {
      + destination_arn = "arn:aws:lambda:ca-central-1:957818836222:function:NotifySlack"
      + distribution    = "ByLogStream"
      + filter_pattern  = "Task timed out"
      + id              = (known after apply)
      + log_group_name  = "/aws/lambda/Response_Archiver"
      + name            = "timeout_detection_in_response_archiver_lambda_logs"
      + role_arn        = (known after apply)
    }

  # aws_cloudwatch_log_subscription_filter.lambda_timeout_detection["submission"] will be created
  + resource "aws_cloudwatch_log_subscription_filter" "lambda_timeout_detection" {
      + destination_arn = "arn:aws:lambda:ca-central-1:957818836222:function:NotifySlack"
      + distribution    = "ByLogStream"
      + filter_pattern  = "Task timed out"
      + id              = (known after apply)
      + log_group_name  = "/aws/lambda/Submission"
      + name            = "timeout_detection_in_submission_lambda_logs"
      + role_arn        = (known after apply)
    }

  # aws_cloudwatch_log_subscription_filter.lambda_timeout_detection["template_archiver"] will be created
  + resource "aws_cloudwatch_log_subscription_filter" "lambda_timeout_detection" {
      + destination_arn = "arn:aws:lambda:ca-central-1:957818836222:function:NotifySlack"
      + distribution    = "ByLogStream"
      + filter_pattern  = "Task timed out"
      + id              = (known after apply)
      + log_group_name  = "/aws/lambda/Archive_Form_Templates"
      + name            = "timeout_detection_in_template_archiver_lambda_logs"
      + role_arn        = (known after apply)
    }

  # aws_cloudwatch_log_subscription_filter.lambda_timeout_detection["vault_data_integrity_check"] will be created
  + resource "aws_cloudwatch_log_subscription_filter" "lambda_timeout_detection" {
      + destination_arn = "arn:aws:lambda:ca-central-1:957818836222:function:NotifySlack"
      + distribution    = "ByLogStream"
      + filter_pattern  = "Task timed out"
      + id              = (known after apply)
      + log_group_name  = "/aws/lambda/Vault_Data_Integrity_Check"
      + name            = "timeout_detection_in_vault_data_integrity_check_lambda_logs"
      + role_arn        = (known after apply)
    }

  # aws_cloudwatch_log_subscription_filter.nagware_log_stream will be destroyed
  # (because aws_cloudwatch_log_subscription_filter.nagware_log_stream is not in configuration)
  - resource "aws_cloudwatch_log_subscription_filter" "nagware_log_stream" {
      - destination_arn = "arn:aws:lambda:ca-central-1:957818836222:function:NotifySlack" -> null
      - distribution    = "ByLogStream" -> null
      - filter_pattern  = "{($.level = \"warn\") || ($.level = \"error\")}" -> null
      - id              = "cwlsf-2378547274" -> null
      - log_group_name  = "/aws/lambda/Nagware" -> null
      - name            = "nagware_log_stream" -> null
    }

  # aws_cloudwatch_log_subscription_filter.reliability_log_stream will be destroyed
  # (because aws_cloudwatch_log_subscription_filter.reliability_log_stream is not in configuration)
  - resource "aws_cloudwatch_log_subscription_filter" "reliability_log_stream" {
      - destination_arn = "arn:aws:lambda:ca-central-1:957818836222:function:NotifySlack" -> null
      - distribution    = "ByLogStream" -> null
      - filter_pattern  = "{($.level = \"warn\") || ($.level = \"error\")}" -> null
      - id              = "cwlsf-2677299195" -> null
      - log_group_name  = "/aws/lambda/Reliability" -> null
      - name            = "reliability_log_stream" -> null
    }

  # aws_cloudwatch_log_subscription_filter.submission_log_stream will be destroyed
  # (because aws_cloudwatch_log_subscription_filter.submission_log_stream is not in configuration)
  - resource "aws_cloudwatch_log_subscription_filter" "submission_log_stream" {
      - destination_arn = "arn:aws:lambda:ca-central-1:957818836222:function:NotifySlack" -> null
      - distribution    = "ByLogStream" -> null
      - filter_pattern  = "{($.level = \"warn\") || ($.level = \"error\")}" -> null
      - id              = "cwlsf-2956744385" -> null
      - log_group_name  = "/aws/lambda/Submission" -> null
      - name            = "submission_log_stream" -> null
    }

  # aws_cloudwatch_log_subscription_filter.template_archiver_log_stream will be destroyed
  # (because aws_cloudwatch_log_subscription_filter.template_archiver_log_stream is not in configuration)
  - resource "aws_cloudwatch_log_subscription_filter" "template_archiver_log_stream" {
      - destination_arn = "arn:aws:lambda:ca-central-1:957818836222:function:NotifySlack" -> null
      - distribution    = "ByLogStream" -> null
      - filter_pattern  = "{($.level = \"warn\") || ($.level = \"error\")}" -> null
      - id              = "cwlsf-2480592169" -> null
      - log_group_name  = "/aws/lambda/ArchiveFormTemplates" -> null
      - name            = "template_archiver_log_stream" -> null
    }

  # aws_cloudwatch_metric_alarm.ELB_5xx_error_warn will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "ELB_5xx_error_warn" {
        id                        = "HTTPCode_ELB_5XX_Count"
      ~ tags                      = {
          - "CostCentre" = "forms-platform-production" -> null
          - "Terraform"  = "true" -> null
        }
        # (18 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.alb_ddos will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "alb_ddos" {
        id                        = "ALBDDoS"
        tags                      = {}
      ~ tags_all                  = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.audit_log_dead_letter_queue_warn will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "audit_log_dead_letter_queue_warn" {
        id                        = "AuditLogDeadLetterQueueWarn"
      ~ tags                      = {
          - "CostCentre" = "forms-platform-production" -> null
          - "Terraform"  = "true" -> null
        }
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_cloudwatch_metric_alarm.cognito_login_outside_canada_warn will be created
  + resource "aws_cloudwatch_metric_alarm" "cognito_login_outside_canada_warn" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:957818836222:alert-warning",
        ]
      + alarm_description                     = "Forms: A sign-in by a forms owner has been detected from outside of Canada."
      + alarm_name                            = "AWSCognitoLoginOutsideCanadaAlarm"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "Region" = "ca-central-1"
          + "Rule"   = "AWSCognitoLoginOutsideCanada"
          + "WebACL" = "GCForms"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "CountedRequests"
      + namespace                             = "AWS/WAFV2"
      + period                                = 60
      + statistic                             = "SampleCount"
      + tags_all                              = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.cognito_signin_exceeded will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "cognito_signin_exceeded" {
        id                        = "CognitoSigninExceeded"
      ~ tags                      = {
          - "CostCentre" = "forms-platform-production" -> null
          - "Terraform"  = "true" -> null
        }
        # (18 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.ddos_detected_forms_warn will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "ddos_detected_forms_warn" {
        id                        = "DDoSDetectedformsWarn"
      ~ tags                      = {
          - "CostCentre" = "forms-platform-production" -> null
          - "Terraform"  = "true" -> null
        }
        # (18 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.ddos_detected_route53_warn[0] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "ddos_detected_route53_warn" {
        id                        = "DDoSDetectedRoute53Warn"
      ~ tags                      = {
          - "CostCentre" = "forms-platform-production" -> null
          - "Terraform"  = "true" -> null
        }
        # (18 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.ddos_detected_route53_warn[1] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "ddos_detected_route53_warn" {
      ~ dimensions                = {
          ~ "ResourceArn" = "Z1031499PBK3926Y7HKK" -> "Z0774184336K3QX9DUJ7E"
        }
        id                        = "DDoSDetectedRoute53Warn"
      ~ tags                      = {
          - "CostCentre" = "forms-platform-production" -> null
          - "Terraform"  = "true" -> null
        }
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.forms_cpu_utilization_high_warn will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "forms_cpu_utilization_high_warn" {
        id                        = "CpuUtilizationWarn"
      ~ tags                      = {
          - "CostCentre" = "forms-platform-production" -> null
          - "Terraform"  = "true" -> null
        }
        # (18 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.forms_memory_utilization_high_warn will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "forms_memory_utilization_high_warn" {
        id                        = "MemoryUtilizationWarn"
      ~ tags                      = {
          - "CostCentre" = "forms-platform-production" -> null
          - "Terraform"  = "true" -> null
        }
        # (18 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.reliability_dead_letter_queue_warn will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "reliability_dead_letter_queue_warn" {
        id                        = "ReliabilityDeadLetterQueueWarn"
      ~ tags                      = {
          - "CostCentre" = "forms-platform-production" -> null
          - "Terraform"  = "true" -> null
        }
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_cloudwatch_metric_alarm.response_time_warn will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "response_time_warn" {
        id                        = "ResponseTimeWarn"
      ~ tags                      = {
          - "CostCentre" = "forms-platform-production" -> null
          - "Terraform"  = "true" -> null
        }
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_cloudwatch_metric_alarm.route53_ddos[0] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "route53_ddos" {
        id                        = "Route53DDoS"
        tags                      = {}
      ~ tags_all                  = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
        # (17 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.route53_ddos[1] will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "route53_ddos" {
      ~ dimensions                = {
          ~ "ResourceArn" = "Z1031499PBK3926Y7HKK" -> "Z0774184336K3QX9DUJ7E"
        }
        id                        = "Route53DDoS"
        tags                      = {}
      ~ tags_all                  = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
        # (16 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.twoFa_verification_exceeded will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "twoFa_verification_exceeded" {
        id                        = "2FAVerificationExceeded"
      ~ tags                      = {
          - "CostCentre" = "forms-platform-production" -> null
          - "Terraform"  = "true" -> null
        }
        # (18 unchanged attributes hidden)
    }

  # aws_cloudwatch_metric_alarm.vault_data_integrity_check_lambda_iterator_age will be created
  + resource "aws_cloudwatch_metric_alarm" "vault_data_integrity_check_lambda_iterator_age" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:957818836222:alert-warning",
        ]
      + alarm_description                     = "Warning - Vault data integrity check lambda is unable to keep up with the amount of events sent by the Vault DynamoDB stream"
      + alarm_name                            = "Vault data integrity check lambda iterator age"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + dimensions                            = {
          + "FunctionName" = "Vault_Data_Integrity_Check"
          + "Resource"     = "Vault_Data_Integrity_Check"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 2
      + id                                    = (known after apply)
      + metric_name                           = "IteratorAge"
      + namespace                             = "AWS/Lambda"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:957818836222:alert-ok",
        ]
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = {
          + "CostCentre" = "forms-platform-production"
          + "Terraform"  = "true"
        }
      + threshold                             = 90000
      + treat_missing_data                    = "notBreaching"
    }

  # aws_iam_role.notify_slack_lambda will be updated in-place
  ~ resource "aws_iam_role" "notify_slack_lambda" {
        id                    = "NotifySlackLambda"
        name                  = "NotifySlackLambda"
      ~ tags                  = {
          - "CostCentre" = "forms-platform-production" -> null
          - "Terraform"  = "true" -> null
        }
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_lambda_function.notify_slack will be updated in-place
  ~ resource "aws_lambda_function" "notify_slack" {
        id                             = "NotifySlack"
      ~ last_modified                  = "2023-08-16T18:18:08.956+0000" -> (known after apply)
      ~ runtime                        = "nodejs14.x" -> "nodejs18.x"
      ~ source_code_hash               = "1jhdhT6lr8Vi+fcLtGWh4KDwpLBmROfUtD6qnYTbujE=" -> "aGx6QTTnU0Sadob77F9K9cNvEB58TKpnkHqYlJvbKtI="
      ~ tags                           = {
          - "CostCentre" = "forms-platform-production" -> null
          - "Terraform"  = "true" -> null
        }
        # (19 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.athena_bucket.aws_s3_bucket.this will be updated in-place
  ~ resource "aws_s3_bucket" "this" {
        id                          = "forms-production-athena-bucket"
      ~ tags                        = {
            "CostCentre" = "forms-platform-production"
          + "Critical"   = "false"
            "Terraform"  = "true"
        }
      ~ tags_all                    = {
          + "Critical"   = "false"
            # (2 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 18 to add, 19 to change, 7 to destroy.

Warning: Argument is deprecated

  with module.athena_bucket.aws_s3_bucket.this,
  on .terraform/modules/athena_bucket/S3/main.tf line 8, in resource "aws_s3_bucket" "this":
   8: resource "aws_s3_bucket" "this" {

Use the aws_s3_bucket_lifecycle_configuration resource instead

(and 3 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.codedeploy_sns"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notify_slack"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ELB_5xx_error_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.alb_ddos"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.audit_log_dead_letter_queue_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.cognito_login_outside_canada_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.cognito_signin_exceeded"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ddos_detected_forms_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ddos_detected_route53_warn[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.ddos_detected_route53_warn[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.forms_cpu_utilization_high_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.forms_memory_utilization_high_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.reliability_dead_letter_queue_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.response_time_warn"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.route53_ddos[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.route53_ddos[1]"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.twoFa_verification_exceeded"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.vault_data_integrity_check_lambda_iterator_age"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.notify_slack_lambda"]
WARN - plan.json - main - Missing...
```

</details>
